function Base.copy(kyokumen::Kyokumen)
    banmen = copy(kyokumen.banmen)
    mochigoma = copy(mochigoma)
    teban = kyokumen.teban
    tesuu = kyokumen.tesuu

end

struct BitKyokumen
    a::UInt128
    b::UInt128
end

code = Dict(
    空 =>      "0",
    歩兵 =>     "01",
    香車 =>   "0011",
    桂馬 =>   "1011",
    銀将 =>   "0111",
    金将 =>  "01111",
    角行 => "011111",
    ☗飛車 => "10111111",
    ☗竜王 => "11111111",
    ☖飛車 => "00111111",
)

0/
0101101/
0100101/

1100.00/
1101.00/
1110.00/
11110.0/

11110.0/
1110.00/
1101.00/
1100.00/

0/
111111.00/
0/
0/
0/
0/
0/
111110.00/
0/

10.00/
10.00/
10.00/
10.00/
10.00/
10.00/
10.00/
10.00/
10.00/

0/
0/
0/
0/
0/
0/
0/
0/
0/

0/
0/
0/
0/
0/
0/
0/
0/
0/

0/
0/
0/
0/
0/
0/
0/
0/
0/

10.10/
10.10/
10.10/
10.10/
10.10/
10.10/
10.10/
10.10/
10.10/

0/
111110.10/
0/
0/
0/
0/
0/
111111.10/
0/

1100.10/
1101.10/
1110.10/
11110.1/

11110.1/
1110.10/
1101.10/
1100.10/

0.1.1
0.0.1

# 初期局面
# 0010110101001011100001101001110001111001111001110001101001100000111111000000011111000010001000100010001000100010001000100000000000000000000000000000010101010101010101010101010101010101001111101000000111111100110010110110111010111101111101111010110110110010
str = "0010110101001011100001101001110001111001111001110001101001100000111111000000011111000010001000100010001000100010001000100000000000000000000000000000010101010101010101010101010101010101001111101000000111111100110010110110111010111101111101111010110110110010"
parse(UInt128, str[1:128], base=2)
parse(UInt128, str[129:256], base=2)

# 256
# hex -> 64 length

0x2d4b869c79e71a60fc07c22222222200
0x000005555555553e81fccb6ebdf7adb2

2d4b86
9c79e7
1a60fc
07c222
222222
000000
055555
55553e
81fccb
6ebdf7
adb200

'0':'9'
'a':'z'
'A':'Z'
'α':'ω'

str = """
0123456789
abcdefghijklmnopqlstuvwxyz
ABCDEFGHIJKLMNOPQRSTUVWXYZ
αβγδεζηθικλμνξοπρςστυφχψω
ΑΒΓΔΕΖΗΘΙΚΛΜΝΞΟΠΡΣΣΤΥΦΧΨΩ
АБВГДЕЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ
абвгдежзийклмнопрстуфхцчшщъыьэюя
"""

""
"abcdefghijklmnopqlstuvwxyz" 26
"ABCDEFGHIJKLMNOPQRSTUVWXYZ" 26
"ÞþÐðØøŁłÄäËëÏïÖöÜüĦħɃƀƎǝ"
"αβγδεζηθικλμνξοπρςστυφχψω" 25
"ΑΒΓΔΕΖΗΘΙΚΛΜΝΞΟΠΡΣΣΤΥΦΧΨΩ" 24
"АБВГДЕЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ" 32
"абвгдежзийклмнопрстуфхцчшщъыьэюя" 32
 4


function bit(kyokumen::Kyokumen)
    for x = 1:9
        for y = 1:9
            masu = kyokumen.banmen[x, y]
            if masu == 空き枡
                str *= code[:空]
            elseif masu == 
        end
    end
end